{
  "name": "Sith Lord of Hunger",
  "size": "medium",
  "type": "humanoid",
  "subtype":"",
  "alignment": "evil",
  "armor_class": 18,
  "hit_points": "25",
  "speed": "30 ft.",
  "ability_scores": {
    "strength": 22,
    "dexterity": 14,
    "constitution": 18,
    "intelligence": 18,
    "wisdom": 22,
    "charisma": 18
  },
  "saving_throws": {
    "strength": 10,
    "dexterity": null,
    "constitution": null,
    "intelligence": null,
    "wisdom": 10,
    "charisma": null
  },
  "skills": {
    "athletics": 10,
    "acrobatics": null,
    "sleight_of_hand": null,
    "stealth": null,
    "demolitions": null,
    "history": null,
    "investigation": null,
    "nature": null,
    "religion": null,
    "repair": null,
    "security": null,
    "arcana": 8,
    "animal_handling": null,
    "insight": null,
    "medicine": null,
    "perception": null,
    "survival": null,
    "deception": null,
    "intimidation": 8,
    "performance": null,
    "persuasion": null
  },
  "damage_vulnerabilities": "",
  "damage_resistances": "psychic",
  "damage_immunities": "necrotic, force",
  "condition_immunities": "charmed",
  "senses": "passive Perception 18",
  "languages": "Basic",
  "challenge": "15",
  "special_abilities": [{
    "name":"Enduring Hunger",
    "desc":"Any creature that ends its turn within 10ft of the Lord of Hunger must make a Constitution saving throw (DC 18). If they fail and they have force points, they lose 5 force points. Regardless, if they fail they take 3d8 necrotic damage. A successful save halves the damage taken from this ability.",
    "attack_bonus": 0
  }, {
    "name":"Psychic Backlash",
    "desc":"As a reaction, you can impose disadvantage on an attack roll against you if you can see the attacker. If the attack still hits you, the attacker takes 2d10 psychic damage.",
    "attack_bonus": 0
  }],
  "actions": [{
    "name": "Multiattack",
    "desc": "The Lord of Hunger can make two melee attacks and one force ability on his turn.",
    "attack_bonus": 0,
    "damage_dice": "",
    "damage_bonus": 0
  }, {
    "name": "Lightsaber",
    "desc": "Melee Weapon Attack: +10 to hit, reach 5ft., one target. Hit 12 (1d10 + 6) radiant damage.",
    "attack_bonus": 10,
    "damage_dice": "2d10",
    "damage_bonus": 6
  }, {
    "name": "Darkness",
    "desc": "As an action, you create an area of magical darkness, which foils darkvision. Choose a spot you can see within 60 feet of you. Magical darkness radiates from that point in a sphere with a 30-foot radius. The light produced by spells of 2nd level or less is suppressed in this area. The darkness dissipates after 3 rounds.",
    "attack_bonus": 0,
    "damage_dice": "",
    "damage_bonus": 0
  }, {
    "name": "Incite Panic",
    "desc": "As an action, choose up to eight creatures you can see within 90 feet of you that can see you. At the start of each of a target’s turns before your concentration ends, the target must make a Wisdom saving throw. On a failed save, the target is frightened until the start of its next turn, and you roll a die. If you roll an odd number, the frightened target moves half its speed in a random direction and takes no action on that turn, other than to scream in terror. If you roll an even number, the frightened target makes one melee attack against a random target within its reach. If there is no such target, it moves half its speed in a random direction and takes no action on that turn. This effect ends on a target if it succeeds on three saving throws against it.",
    "attack_bonus": 0,
    "damage_dice": "",
    "damage_bonus": 0
  }, {
    "name": "Mind Storm",
    "desc": "As an action, choose a point you can see within 60 feet of you. Each creature in a 20-foot-radius sphere centered on that point must make a Wisdom saving throw. On a failed save, a target takes 6d8 psychic damage and suffers disadvantage on all saving throws until the end of your next turn. On a successful save, a creature takes half as much damage.",
    "attack_bonus": 0,
    "damage_dice": "6d8",
    "damage_bonus": 0
  }, {
    "name": "Phantom Foe",
    "desc": "As an action, choose one creature you can see within 60 feet of you. The target must make an Intelligence saving throw. On a failed save, it perceives a horrid creature adjacent to it until your concentration ends. During this time, the target can’t take reactions, and it takes 3d8 psychic damage at the start of each of its turns. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.",
    "attack_bonus": 0,
    "damage_dice": "3d8",
    "damage_bonus": 0
  }],
  "legendary_actions": [{
    "name":"Psychic Backlash",
    "desc":"The Lord of Hunger can use Psychic Backlash as a legendary action.",
    "attack_bonus": 0
  }],
  "source":"star-wars"
}
