{
  "name":"Mandalorian Vambraces",
  "description":"Mandalorian vambraces were devices designed to combat the abilities of a Jedi. They came equipped with a repulsor, grappling line, paralyzing darts, a shield emitter, paired blaster barrels, and a flamethrower. The Mandalorians developed these vambraces alongside their armor as a reaction to the Jedi's Force abilities encountered during the Mandalorian-Jedi War. The vambraces have 6 charges between the two of them, and they regain 1d4 + 1 charges each dawn. Any ranged weapon attack made with the vambraces does not have disadvantage when the attacker is within 5ft of an enemy.<br/><br/>***Dual Blasters.*** You use an action and make a ranged weapon attacks against a creature you can see within 60ft of you. You have proficiency with these attacks if you have proficiency with Mandalorian weapons. On a hit, the attack deals 1d6 radiant + dexterity modifier damage. You can make a second attack in this way as a bonus action. You must use a bonus action to reload the vambraces with a charge pack after 6 uses. This weapon counts as a pistol in regards to the pistol expert feat.<br/><br/>***Grappling Line (1 charge).*** Using one charge and an action, you can use the grappling line to rappel down a face, grapple and pull yourself to a location no more than 200ft away, or attempt to grapple a creature. If you attempt to grapple a creature, make a ranged weapon attack against it as though you were using the dual blasters ability of these gauntlets. On a hit, the creature is grappled by you.<br/><br/>***Shield (1 charge).*** As a reaction when you are hit by an attack, you can expend one charge from the vambraces to shield yourself from it. You immediately add +3 to your AC for the remainder of the round. If the attack would not have hit your new AC, it misses.<br/><br/>***Flamethrower (2 charges).*** Expending 2 charges of the vambraces and using an action, you shoot a 20ft line of fire from your wrists that engulfs nearby enemies. Any enemy in the line must make a DC 14 Dexterity saving throw or it takes 4d6 fire damage. On a successful save, the creature takes half damage.<br/><br/>***Paralyzing Dart (2 charges).*** You expend 2 charges and make a ranged weapon attack against a creature. On a hit, the creature takes 2d10 piercing damage and must make a DC 14 Constitution saving throw. On a failed save, the creature is paralyzed and falls prone. At the end of each of the paralyzed creature's turns, it can repeat the saving throw again, ceasing to be paralyzed on a successful save.<br/><br/>***Repulsor (2 charges).*** Expend 2 charges and make a ranged weapon attack against a creature within 10ft of you. On a hit, the creature takes 2d10 bludgeoning damage and must make a DC 14 Strength saving throw. On a failed save, the creature is pushed up to 20ft away from you and is knocked prone.",
  "type": "armor",
  "sub_type": "gauntlets",
  "rarity": "legendary",
  "attunement": true,
  "notes": "Range, Gloves",
  "tags": [
    "wristwear"
  ]
}
