[{"name":"A/V Recorder","type":"toolbelt","subtype":"","activation":"object","desc":"This gadget allows you to record sound and/or visual images of objects that you can see and hear within 60 feet of you. You can begin recording by taking an object interaction to activate the gadget and you can take a second object interaction to stop the recording. When you activate the recorder, you can chose to record sound only, images only, or both images and sound. Messages of up to 1 minute in length can be recorded and stored recordings can be played back by taking an object interaction.","level":1,"restrictions":"","cost":50},{"name":"Adaptive Armor","type":"armor","subtype":"","activation":"reaction","desc":"When equipped to an armor, you can use a reaction when hit with an attack or ability that deals thunder, acid, cold, lightning, fire, or radiant damage. You gain resistance against the damage type chosen until the beginning of your next turn.","level":3,"restrictions":"engineer, mercenary","cost":500},{"name":"Advanced Personal Stealth Field","type":"tool","subtype":"","activation":"action","desc":"When equipped, as an action, you can activate the field to temporarily gain +5 to all stealth check for up to 10 minutes. This duration of the field increases to 20 minutes at level 7, 45 minutes at level 14, and an hour at level 17. <br/><br/>***Shared field.*** As an action, you may instead create a small 10ft radius sphere of your stealth field, giving anyone inside the field the bonus of the field. However because of the expanded range the duration of the field becomes halved, and after use, its energy is expended and a long rest must be taken to recharge it.","level":3,"restrictions":"","cost":500},{"name":"Anti-Theft Device","type":"toolbelt","subtype":"","activation":"constant","desc":"When this gadget is equipped, other creatures have disadvantage on any Dexterity (Sleight of Hand) checks that they make in an attempt to steal objects that are in your possession. Additionally, you automatically know when a failed attempt to pick your pockets has been made.","level":1,"restrictions":"","cost":80},{"name":"Arkanian Energy Shield","type":"armor","subtype":"shield","activation":"constant","desc":"Arkanian Energy shields are personal shields that protect from extreme temperatures and energy and sonic-based weaponry. This shield has an AC of 16 with 40 HP and has resistances to sonic and energy-based weaponry. Once it’s HP hits 0 the shield is destroyed and a new one must be built. You may only have one personal shield equipped at a time.","level":3,"restrictions":"","cost":550},{"name":"Autoloader","type":"weapon","subtype":"attachment","activation":"constant","desc":"When you attach this gadget to a weapon of your choosing it lowers the reload time of the weapon by 1 action. For example, with a gatling laser, instead of taking a full turn to reload, it would instead take a regular action when this gadget is attached.","level":3,"restrictions":"engineer, mercenary","cost":600},{"name":"Breathalyzer","type":"toolbelt","subtype":"","activation":"object","desc":"You can use this gadget to identify a type of poison or disease that is affecting a creature. The afflicted creature must make an object interaction to breathe into the gadget. After 1d4 rounds you can determine indicate the type of disease or poison, or the type of creature that created the poison. <br/><br/>***Synthesize Antidote.*** After analyzing the breath of an infected creature, you can take an action to synthesize an antidote or an antitoxin, Once begun, it takes the gadget 1d4 rounds to create the antidote. Drinking the antidote give the infected advantage to their next saving throw against the disease or poison. Only the creature that breathed into the device can benefit. Once this effect is used, it must be recharged and cannot be used again until a short or long rest.","level":1,"restrictions":"engineer","cost":40},{"name":"Bug","type":"toolbelt","subtype":"","activation":"action","desc":"This gadget which is a tiny probe bot, when activated, has AC 10, 1 hit point, a movement/flying speed of 30, and cannot attack. It can take no actions on its own, but you can control the clockwork insect via a wireless communications link. While controlling the clockwork you perceive through the robot’s senses and are deaf and blind with regard to your own senses. The wireless link is lost and the gadget is deactivated if the clockwork moves further than 100 feet away from you or if you take an object interaction to disable it. At 10th level its speed is increased to 60 feet and the maximum range is increased to 200.","level":1,"restrictions":"engineer, mercenary","cost":150},{"name":"Cape of the Bat","type":"clothing","subtype":"cloak","activation":"action","desc":"When you take an object interaction to activate this gadget, your cloak becomes rigid, allowing you to glide down from a high place. You can fly at a speed of 30 feet for a maximum distance of up to three times the height of your starting point. (If you begin at a height of 30 feet, you can glide a maximum of 90 feet from your starting point.) If you are still airborne when you reach the maximum distance, you fall. Once used, the gadget must be reset and this effect cannot be used again until you complete a short or long rest.","level":3,"restrictions":"engineer","cost":800},{"name":"Climbsuit","type":"armor","subtype":"","activation":"constant","desc":"The climbsuit is a suit of light armor that is used for climbing. Its knees, elbow pads, and gloves are covered in Frictiongrip. This is an armor that has an ac of 11 + dexterity modifier and can be used to climb any surface as long as your knees and hands are on the surface of which you are climbing.","level":4,"restrictions":"","cost":2000},{"name":"Cluster Charge","type":"weapon","subtype":"breaching","activation":"action","desc":"When equipped, the cluster charge can be used against breachable surfaces. When placed against the surface, it releases 5 small grenades into the room. To evaluate where they grenades land, divide the room into 10ft. squares and assign the squares numbers. Use an appropriate die to randomly assign where the grenades land. When the grenade explodes it deals 1d4 bludgeoning damage to all enemies within the radii, and the radii stack.","level":4,"restrictions":"","cost":3500},{"name":"Concealed Carry","type":"toolbelt","subtype":"","activation":"constant","desc":"When this gadget is equipped, the weapon that this gadget is integrated into becomes easier to hide. You get a +2 bonus and have advantage on Dexterity (Sleight of Hand) checks to prevent the weapon from being found during any search of your person. If the weapon requires ammunition, up to 2 charge pack, including the one already in your weapon, are hidden as well.","level":2,"restrictions":"","cost":350},{"name":"Cryoban Cells","type":"charge pack","subtype":"","activation":"bonus","desc":"When equipped, the user can load a CryoBan cell into their weapon. When they do so, the damage type of their weapon is converted to cold and gains the effect of Freeze. The amount of use would be only one cartridge worth of ammunition and once used must be recharged through a long rest.<br/><br/>Freeze. When a creature is hit with CryoBan Cells it must make a constitution saving throw (DC 15) or it is frozen.<br/><br/>When you are frozen your movement speed becomes 0, you cannot make any actions or reactions, and at the end of your turn you may make the DC save again. If you keep hitting them with the cells it stacks the effect. If a creature remains frozen for more than 1 minutes it dies.","level":3,"restrictions":"","cost":800},{"name":"Defibrilator","type":"gloves","subtype":"","activation":"action","desc":"When you take 1 object interaction to activate this gadget, you can target an unconscious, dying target within 10 feet of you and they regain 1 hp. Once used, the gadget must be recharged and cannot be used until a short or long rest.","level":1,"restrictions":"","cost":100},{"name":"Dew-Condeser Jugs","type":"backpack","subtype":"","activation":"object","desc":"The Dew condenser Jug was created for use on dry planets such as Tatooine to draw water from the atmosphere. It is a large water container that once activated must be left outside for about 8 hours or less depending upon the environment before becoming full.","level":1,"restrictions":"","cost":40},{"name":"Disintegrator 9000","type":"weapon","subtype":"ranged","activation":"action","desc":"The Disintegrator 9000 takes the form of a large heavy beam cannon that shoots out a powerful beam of force towards a target up to 60 feet away from you. The target can be a creature or an object.<br/><br/>When targeted, the target must make a dexterity saving throw (DC 15). If the target succeeds the saving throw, the gadget has no effect. If the saving throw fails, the target takes 95 (10d6 + 40) force damage. If this damage reduces the target to 0 hit points, it is disintegrated. The disintegrated creature and everything it is wearing and carrying, except magical items, are reduced to a pile of fine gray dust. This effect automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this effect disintegrates a 10-foot-cube portion of it. Magic items are unaffected.<br/><br/>Once this effect has been used, the gadget must be recharged and cannot be used again until you have completed a short or long rest.","level":4,"restrictions":"","cost":10000},{"name":"Durasteel Plating","type":"turret","subtype":"","activation":"constant","desc":"When this gadget is equipped, your turret gains a +2 to their AC.","level":2,"restrictions":"engineer","cost":300},{"name":"Electrified Net","type":"weapon","subtype":"net","activation":"continuous","desc":"This is a normal net for all intents and purposes, except it is electrified. Creatures stuck in the net will be shocked into submission until they escape or are released.<br/><br/>***Ensnare.*** *Ranged Weapon Attack* thrown 5/15. On a hit, the target is ensnared by the net. When the target becomes ensnared and at the beginning of each of its turns while still in the net, it must make a DC 12 Constitution saving throw or it is stunned until the beginning of its next turn.","level":2,"restrictions":"Engineer, Mercenary","cost":200},{"name":"Electromagnetic Gloves","type":"gloves","subtype":"","activation":"action","desc":"When this gadget is equipped, you can take an action to target a creature within 30 feet of you that is wielding a weapon or holding an object made of metal that weighs 9 pounds or less. The target must make a Strength saving throw. On a failed save, they drop the object, which flies through the air and into your hands. Once used, the effect must be recharged and cannot be used again until you complete a short or long rest.","level":2,"restrictions":"engineer","cost":300},{"name":"Expanded Turret Capacity","type":"turret","subtype":"","activation":"constant","desc":"When this gadget is equipped to your turret, it increase the number of charge pack it can carry by two.","level":2,"restrictions":"engineer","cost":300},{"name":"Explosive Traps","type":"weapon","subtype":"explosive","activation":"action","desc":"As an action, this gadget allows you to place a mechanical trap on an unoccupied location within 5 feet of you. When you place the trap you may choose it’s damage type and trigger mechanism.<br/><br/>Trigger Mechanism<br/>Location:5x5 area within 20 ft of trap<br/>Proximity: 8 ft radius sphere around trap.<br/>Timed: between 1 minute to an hour.<br/><br/>The trap becomes active the turn after you activated and remains active unless deactivated or disarmed. When activated, the trap explodes and deals 2d10 damage of the damage type to everything within 30 feet of the trap. The damage increase by 1d10 at 11th and then again at 17th level. Once used it must be recharged and its effects cannot be used again until after a successful short or longs rest.","level":3,"restrictions":"","cost":1000},{"name":"Extendable Shield","type":"armor","subtype":"shield","activation":"constant","desc":"When equipped it is a regular shield, but as an object interaction you can extend or retract the shield. When extended, you gain 3/4 cover in front of you and your movement is halved. This shield is considered heavy armor for the purposes of proficiency.","level":3,"restrictions":"engineer","cost":600},{"name":"Full Auto Conversion","type":"weapon","subtype":"ranged","activation":"action, object","desc":"When this gadget is equipped, the firearm that the gadget is integrated into gains the Burst Fire property. You can use the weapon to take a normal attack action, or you can use an object interaction in conjunction with an attack action to spray a 30 foot cone area within normal range with plasma rounds. Each Creature in the area must succeed on a Dexterity saving throw (DC 15)or take 8 die of the weapon's normal damage die radiant damage. On a failed save a creature takes half as much damage. This action consumes eight pieces of ammunition. ","level":4,"restrictions":"engineer, mercenary","cost":1800},{"name":"G-52 Tactical Shield","type":"armor","subtype":"shield","activation":"action","desc":"This shield gives a +3 to your AC when equipped. This shield has exceptionally bright lights and as an action you can shine your light in a 60 ft cone. Everyone within this cone must make a constitution saving throw (DC 14) or be blinded for 1 minute. Once used, this gadget cannot be used again until it is recharged via a short or long rest.","level":3,"restrictions":"engineer","cost":750},{"name":"Gatling Turret","type":"weapon","subtype":"ranged","activation":"constant","desc":"When this weapon is equipped, you can equpt a gatling laser onto your turret. Your turret is proficient with this weapon and gains and the bonuses and benefits using it.","level":3,"restrictions":"engineer","cost":600},{"name":"Glue Gun","type":"weapon","subtype":"","activation":"interaction, attack","desc":"When the glue gun is attached to a weapon, you use it in conjunction with a weapon attack to shoot a ball of super glue that splatters within a ten foot radius. The glue lasts for 30 minutes after which it dries and crumbles away.A creature that enters or ends their movement in an area covered by the glue must succeed on a Dexterity saving throw or become trapped by the glue. A creature trapped by the glue has its speed reduced to 0 as long as they remain stuck. As an action, a creature stuck by the glue can make a Strength saving throw to break free. You get 2 charges and after both uses, the glue gun must recharged and cannot be used again till a long rest.","level":2,"restrictions":"engineer","cost":150},{"name":"Grenade Launcher","type":"weapon","subtype":"ranged","activation":"action, object","desc":"When you make a weapon attack, you can use an object interaction with a grenade of your choosing to launch the grenade instead. The attack roll is your normal weapon attack roll, plus your demolitions skill. The grenade deals its normal damage.","level":3,"restrictions":"engineer, mercenary","cost":1200},{"name":"Implanted Healing Systems","type":"armor","subtype":"","activation":"action, reaction","desc":"When you use an action to activate this gadget you regain a number of hit points equal to 1d8 + your Intelligence modifier. The amount healed increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8). Once used, the gadget must be reset and cannot be used again until you complete a short or long rest. <br/><br/>***Self Defense.*** When you are damaged by a single attack or effect, you can use your reaction to activate your healing infusion. You regain a number of hit points equal to 1d4 + your Intelligence modifier. The amount healed increases by 1d4 when you reach 5th level (2d4), 11th level (3d4), and 17th level (4d4). Once used, the gadget must be reset and cannot be used again until you complete a short or long rest.","level":2,"restrictions":"engineer","cost":500},{"name":"Implanted Tracking Device","type":"toolbelt","subtype":"","activation":"action","desc":"When equipped, the user may make an attack action to fire dart at a creature within 40 feet of you; adding your dexterity modifier to the attack. If hit, the creature takes 1d4 damage and now has a tracking device implanted within them. As long as the device is functional, and you have a datapad, you will know the direction of your quarry as long as they are on the same planet as you are.The tracking device functions for 24 hours or until you take an object interaction to deactivate it. The presence of the tracking device is not immediately noticeable to the target unless they have a passive perception score higher than your gadget saving throw DC. An intelligent creature that is aware of the presence of the tracking device can chose to cut it out from under their skin using a bladed weapon that deals piercing or slashing damage. You can chose to fire another dart and implant a tracking device under the skin of a different creature after taking a short or a long rest. However, you can have only one active tracking device at any one time.","level":2,"restrictions":"engineer, mercenary","cost":450},{"name":"Inflatable Boots","type":"boots","subtype":"","activation":"interaction","desc":"When this gadget is equipped, you gain the ability to move across any liquid (water, quicksand, lava etc.) as if it were solid ground. If the liquid is harmful (such as acid or lava) you still take damage for coming into contact with it.","level":2,"restrictions":"","cost":200},{"name":"Invisibility Generator","type":"toolbelt","subtype":"","activation":"action","desc":"When you use an object interaction to activate it, this gadget projects a light-bending sphere of energy in a 10 foot radius around you. The sphere renders you and all other creatures inside of it invisible to any creature that is outside of the sphere. Equipment that is worn or carried by a creature inside of the sphere is invisible as long as it is on the creature’s person. The sphere and its effect moces as you move. The effect lasts for one minute or until you take a second object interaction to cancel it. Once used, the gadget must be recharged and cannot be used again until you complete a short or a long rest.","level":4,"restrictions":"","cost":2000},{"name":"JT-12 Jetpack","type":"backpack","subtype":"","activation":"action, constant","desc":"This jetpack has 5 fuel units. You regain all units of fuels after spending an entire round without using it.<br/><br/>***Flight (1fu).***You may expend a unit of fuel to gain a flying speed of 30 feet until the end of your turn. <br/><br/>***Hover (1fu).*** You expend a unit of fuel to hover at your current altitude, and become immune to falling damage until the beginning of your next turn. While you are hovering you may use your jetpack to shift in midair up to your half base speed. <br/><br/>***Increased Speed (2fu).***You may expend two units of fuel to double your flying speed. <br/><br/>***Missile (2fu).*** You may use two units of fuel and an action to fire the Z-6 anti-vehicle homing missile. This attack uses your proficiency bonus (as long as you are proficient with heavy weapons) and either your dexterity or strength modifier for the attack. The attack can be made against a target that you do not have direct line of sight to as long as the target is within the weapon’s range and you know its location. This attack ignores the effects of cover. Once used, this gadget must be reset and cannot be used again until you complete either a short or a long rest. <br/><br/>The rocket's damage and DC are equivalent to that of the standard rocket launcher.","level":4,"restrictions":"","cost":4000},{"name":"Lightning Gun","type":"weapon","subtype":"ranged","activation":"action, object","desc":"When you make a weapon attack, you may use an object interaction to shoot a bolt of lightning at an opponent. The target takes 6d6 lightning damage on a hit, or half as much on a miss, instead of the normal weapon damage. On a hit or miss, creatures within 10 feet of the target must make a dexterity saving throw (DC 14), taking 3d6 lightning damage on a failed save, and half as much on a successful save. Once used, this gadget must be recharged and its effect cannot be used again until you complete a short or long rest.","level":3,"restrictions":"","cost":1500},{"name":"Mandalorian Power Shield","type":"armor","subtype":"shield","activation":"constant","desc":"When equipped, this shield has an AC of 13, HP equal to 10 + your int mod + twice your engineer level, and resistance against all melee weapons and energy based weapons. When its HP hits 0, it can only be recharged through a long or short rest. You may only have one personal shield equipped at a time.","level":4,"restrictions":"engineer, mercenary","cost":2500},{"name":"Mass-Nulling Clip","type":"toolbelt backpack","subtype":"","activation":"constant","desc":"The Mass-nulling clip is a device that can create a field of low gravity to carry heavy loads upon one’s back or belt clip. When equipped the carrier’s maximum carry weight is doubled.","level":1,"restrictions":"","cost":40},{"name":"Medpacs","type":"consumable","subtype":"","activation":"action","desc":"When equipped, as an action, you can use the medpac on a creature to heal up to 50 hit points. Once used, the materials are expended and you must spend the time to make another one.","level":2,"restrictions":"","cost":100},{"name":"Memory Flush Unit","type":"toolbelt","subtype":"","activation":"action","desc":"When this gadget is equipped, you can take an action to activate it, targeting a creature you can see within 5 feet of you. The target must then make a intelligence saving throw. If they succeed, they are immune to the effect of this gadget for the next 24 hours. If they fail to save, they permanently forget the events of the last 1 minute. At 5th level the amount of time they can forget increase to 2 minutes. This increases again at 11 to 3 minutes, 15 to 4 minutes, 17 to 5 minutes.","level":2,"restrictions":"engineer","cost":120},{"name":"Mini Missles","type":"gloves","subtype":"","activation":"attack","desc":"When this gadget is equipped you can use an action to activate it. If you do, you fire tiny missiles out of your gloves. Make a ranged weapon attack against any number of creatures of your choice that you can see within 80 feet of you. Each rocket deals 1d6+1 bludgeoning damage to its target. The rockets all strike simultaneously, and you can direct them both to hit the same, or different targets. At 5th level you can fire an additional rocket (4 rockets total). This increases by an additional rocket at 11th (6 rockets) and 17th levels (8 rockets). Once used, this gadget must be reloaded and cannot be used again until you complete a short or a long rest.","level":1,"restrictions":"engineer, mercenary","cost":300},{"name":"Mining Drill","type":"toolbelt","subtype":"","activation":"action","desc":"When equipped, the drill allows you to have a burrowing speed of equal to half your movement speed, which lasts for three turns. The hole created by this drill is 5’ wide and half as tall as your height. Once used it must be recharged, and its effects cannot be used again until after a short or long rest.","level":4,"restrictions":"","cost":3000},{"name":"MM9 mini-concussive rocket launcher","type":"gloves","subtype":"","activation":"attack","desc":"When this gadget is equipped you can use an action to activate it. When you do, you fire an explosive rocket out of the gauntlet. Make a ranged weapon attack against one enemy within 60ft of you. If it hits, it deals 1d8 bludgeoning damage. The number of die you roll increases at level 5 to 2d8, then again at 11 to 3d8 and 17 to 4d8.","level":1,"restrictions":"engineer, mercenary","cost":250},{"name":"Night-Vision Goggles","type":"headgear","subtype":"","activation":"interaction","desc":"When activated, the user gains night vision equal to their normal vision for up to 8 hours. After it has been used it must be recharged and cannot be used until after a long or short rest.","level":2,"restrictions":"engineer","cost":250},{"name":"Rebreather","type":"headgear","subtype":"","activation":"constant, action","desc":" You can breathe underwater while you have this gadget equipped. Air Filter. While this gadget is equipped, you can take an action to activate an emergency air filter that is built into the gadget. For one minute after activation, you have advantage on saving throws made against harmful gases and vapors. Once used, this effect must be recharged and cannot be used again until you complete a short or long rest","level":1,"restrictions":"","cost":40},{"name":"Recovery Field","type":"toolbelt","subtype":"","activation":"constant","desc":"Anyone within 60 feet of you regain hit points at the end of a short rest, each such creature regains an extra 1d4 hit points. The amount of hit points healed increases to 1d6 hit points when you reach 11th level and again to 1d8 at 17th level.","level":2,"restrictions":"engineer","cost":250},{"name":"Repairpacs","type":"consumable","subtype":"","activation":"action","desc":"When equipped, as an action, you can use it to give you advantage and +5 to repair check. Whenever  you use this item it’s resources are expended and must be recharged after a long rest.","level":2,"restrictions":"","cost":150},{"name":"Repulsor Grappling Gun","type":"weapon","subtype":"attachment","activation":"action","desc":"The repulsor grappling gun is a rifle containing 200 meters of molecularly reinforced line that can pull up to 200 kilograms at 20 meters per second. As an action, the user can aim the grappling gun at a surface and make a weapon attack. On a hit, the hook becomes attached to the surface and the user can climb up to 390 ft per round. The hook cannot be used on flat ground and the user must have both hands holding the gun while climbing.","level":3,"restrictions":"","cost":500},{"name":"Retractable Bayonet","type":"ranged weapon","subtype":"","activation":"object, attack","desc":"A weapon equipped with this gadget now has a hidden retractable bayonet, allowing the weapon to be used as an effective close quarters melee weapon. The bayonet can be deployed or hidden using an object interaction. As long as the bayonet is deployed, you can use the weapon to make a melee attack, adding both your proficiency bonus and your choice of either your Strength or Dexterity modifier to the attack roll. If the attack hits, the bayonet deals 1d6 plus either your Strength or Dexterity modifier in piercing damage. If you hit a creature of size large or smaller with the bayonet, you can choose to push the creature up to 5 feet away to you.","level":1,"restrictions":"","cost":250},{"name":"Retractable Stilts","type":"boots","subtype":"","activation":"object","desc":"When this gadget is equipped, you can take an object interaction to unfold telescoping stilts out of your footwear, increasing your effective height by 5 feet and enabling you to reach objects which you could not otherwise. While the stilts are deployed, walking counts as difficult terrain. If you make a weapon attack or are hit by an attack you must make a DC 13 Dexterity (Acrobatics) check or be knocked prone. You have disadvantage on any check to resist being pushed. You can retract the stilts by taking a second object interaction.","level":1,"restrictions":"","cost":100},{"name":"Sonic Loudspeaker","type":"headgear","subtype":"","activation":"action, interaction","desc":"This gadget consists of a powerful amplifier that can focus a spoken word into a beam of compressed sound. When this gadget is equipped, you can use an object interaction in conjunction with an attack action to make a ranged attack at a target you can see within 60 feet of you. You add both your proficiency bonus and Dexterity modifier to the attack roll. If the attack hits, the beam deals 3d6 thunder damage to the target. Additionally, if the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet away from you and knocked prone. This gadget cannot be used if you are rendered unable to speak. Once used this gadget must be recharged and cannot be used again until you take a short or a long rest.","level":2,"restrictions":"engineer","cost":350},{"name":"Sonic Screwdriver","type":"toolbelt","subtype":"","activation":"action","desc":"This metal device measures about 8 inches long and weighs 1 pound. You can use an action, pointing it at an object within 120 feet of you that can be opened, such as a door, lid, or lock. The screwdriver issues a sonic tone, and one lock or latch on the object opens unless the sound can't reach the object. If no locks or latches remain, the object itself opens.","level":4,"restrictions":"","cost":5500},{"name":"Sound-Dampening Stealth Field","type":"boots toolbelt","subtype":"","activation":"constant","desc":"This gadget creates a field that dampens and almost mutes all sound you make but you are still visible. When activated, for up to an hour, you gain advantage on all stealth checks. Once activated it cannot be used again until after a long or short rest.","level":1,"restrictions":"engineer","cost":150},{"name":"Targeting Assistance Mem-stick","type":"datapad","subtype":"mem stick","activation":"constant","desc":"The targeting assistance mem-stick is a reformatted memory stick that when plugged into a datapad gives the user constant updates on hostile target positions. The mem-stick allows the user to use a bonus action to begin tracking up to 10 targets. You know a tracked target's position within 600 feet of you, and have advantage on attack rolls against tracked enemies.","level":4,"restrictions":"","cost":5500},{"name":"Targeting Scope","type":"weapon","subtype":"ranged","activation":"constant","desc":"This gadget increases your accuracy when you make an attack with the weapon it is attached to. You do not suffer disadvantage when you use this weapon to attack a target outside the weapon's effective range.","level":3,"restrictions":"engineer","cost":600},{"name":"Tinfoil Hat","type":"clothing","subtype":"hat","activation":"continuous","desc":"As long as you are wearing this gadget you gain resistance to psychic damage and gain advantage on saving throws against your mind.","level":3,"restrictions":"","cost":300},{"name":"Tranquilizer Watch","type":"toolbelt","subtype":"","activation":"constant, attack","desc":"This gadget tells you the exact time, date, and day of the week Tranq Dart. When this gadget is equipped, you can use an object interaction in conjunction with an attack action to fire a spring, loaded dart at a target you can see within 30 feet of you. You add your proficiency bonus and Dexterity modifier to the attack roll. If the attack hits, the target takes 1d4 piercing damage and must make a Constitution saving throw or fall unconscious for 10 minutes. The unconscious creature awakens if it takes damage or if someone uses an action to shake or slap it awake. Once used, the effect must be reset and cannot be used again until you complete a short or long rest.","level":1,"restrictions":"","cost":150},{"name":"Ultra Power Blast","type":"weapon","subtype":"starship","activation":"action","desc":"The ultra-power blast is a weapon that can be added to any small or larger starship. It is capable of dealing immense amounts of ion damage and can even disable Star Destroyers.<br/><br/>When equipped on a ship, you can make an weapon attack with the ultra power blast. If it hits, it deals 5,000 ion damage","level":4,"restrictions":"","cost":10000},{"name":"Universal Translator","type":"headgear","subtype":"","activation":"constant","desc":"As you have this gadget equipped, you constantly understand and can speak almost any language.","level":1,"restrictions":"","cost":150},{"name":"Valkyrie Cameras","type":"toolbelt","subtype":"grenade","activation":"action, object","desc":"When you have this gadget equipped you gain two small, deployable cameras that can attach to any surface. To use them, you must make a grenade check with them to see where they land. These cameras have 60ft. darkvision. It takes 1 object interaction to see through the chosen camera. The cameras last up to 8 hours. After you use a camera, you cannot use it again until you recharge it during a short or long rest. The number of cameras you can have increases to 3 at level 11 and 4 at level 17.","level":3,"restrictions":"","cost":1000},{"name":"Velocity-7 Dart Shooter","type":"weapon","subtype":"ranged","activation":"action","desc":"This gadget is a Velocity-7 Dart Shooter integrated into your gloves/gauntlets. You can use an object interaction in conjunction with an attack action to fire a powerful dart of your choosing at a target you can see within 60 feet of you. You add your proficiency bonus and dexterity modifier to the attack roll. If the attack hits the target suffers the effect of the chosen dart. The darts you can choose from are listed below. Once used, the effect must be reset and cannot be used again until you complete a short or long rest.<br/><br/>***Kaminoan Saberdart.*** When hit with this dart the enemy must make a constitution saving throw. If they succeed the throw, the effect fail. If they fail the throw they must take 62 (12d6 + 20) poison damage.<br/><br/>***Sleep Dart.***  the target takes 2d4 piercing damage and must make a Constitution saving throw (DC 16) or fall unconscious for 24 hours.","level":4,"restrictions":"engineer, mercenary","cost":5000},{"name":"Water Purifier","type":"backpack","subtype":"","activation":"object","desc":"The Water purifier is a tool that is placed within a body of water and can be used to pull out water and purify it to become drinkable.","level":1,"restrictions":"","cost":150},{"name":"Wheeled Heels","type":"clothing","subtype":"shoes","activation":"constant","desc":"While this gadget is equipped, you can use a bonus action on each of your turns to take the Dash action.<br/><br/>***Rocket Shoes.*** You can take an object interaction to fire rockets built into your boots, causing your walking speed to be doubled and any creature that makes an opportunity attack against you has disadvantage on the attack roll. This effect lasts for one minute. Once used, this effect must be recharged and it cannot be used again until you complete a short or long rest.","level":4,"restrictions":"","cost":2000},{"name":"ZX Miniature Flame Projector","type":"armor","subtype":"gloves","activation":"action","desc":"When you use this gadget, you shoot a 15ft. line of flames from your wrist. Anyone along this line must make a dexterity saving throw (DC 15). On a failed save, the creature takes 4d6 fire damage and is on fire, taking 1d6 fire damage at the start of its turn. On a successful save the creature takes half damage. Creatures on fire can use an action to put the fire out. Once used, this gadget must be recharged and its effect cannot be used again until you complete a short or long rest.","level":3,"restrictions":"","cost":750}]