{
    "name":"Aura Sight",
    "description":"You refocus your sight to see the energy that surrounds all creatures. You perceive auras, energy signatures that can reveal key elements of a creature’s nature.",
    "order":"Consular",
    "focus":"While focused on this discipline, you have advantage on Wisdom (Insight) checks.",
    "abilities":[{
      "discipline":"Aura Sight",
      "name":"Assess Foe",
      "cost":"2",
      "conc":false,
      "casting_time":"bonus",
      "duration":"",
      "target":["creature"],
      "range":"sight",
      "description":"As a bonus action, you analyze the aura of one creature you see. You learn its current hit point total and all its immunities, resistances, and vulnerabilities."
    }, {
      "discipline":"Aura Sight",
      "name":"Read Moods",
      "cost":"2",
      "conc":false,
      "casting_time":"bonus",
      "duration":"",
      "target":["creature"],
      "range":"sight",
      "description":"As a bonus action, you learn a one-word summary of the emotional state of up to six creatures you can see, such as happy, confused, afraid, or violent."
    }, {
      "discipline":"Aura Sight",
      "name":"View Aura",
      "cost":"3",
      "conc":true,
      "casting_time":"action",
      "duration":"1 hour",
      "target":["creature"],
      "range":"sight",
      "description":"As an action, you study one creature’s aura. Until your concentration ends, while you can see the target, you learn if it’s under the effect of any magical or force effects, its current hit point total, and its basic emotional state. While this effect lasts, you have advantage on Wisdom (Insight) and Charisma checks you make against it."
    }, {
      "discipline":"Aura Sight",
      "name":"Perceive the Unseen",
      "cost":"5",
      "conc":true,
      "casting_time":"bonus",
      "duration":"1 minute",
      "target":["self"],
      "range":"",
      "description":"As a bonus action, you gain the ability to see auras even of invisible or hidden creatures. Until your concentration ends, you can see all creatures, including hidden and invisible ones, regardless of lighting conditions."
    }]
}