{
    "name":"Crown of Disgust",
    "description":"You cause a creature to be flooded with emotions of disgust.",
    "order":"Sentinel",
    "focus":"While you are focused on this discipline, the area in a 5-foot radius around you is difficult terrain for any enemy that isn’t immune to being frightened.",
    "abilities":[{
      "name":"Eye of Horror",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["creature"],
      "range":"60ft",
      "damage":"nd6 psychic",
      "description":"As an action, choose one creature you can see within 60 feet of you. The target must make a Charisma saving throw. On a failed save, it takes 1d6 psychic damage per force point spent and can’t move closer to you until the end of its next turn. On a successful save, it takes half as much damage."
    }, {
      "name":"Wall of Repulsion",
      "cost":"3",
      "conc":true,
      "casting_time":"action",
      "duration":"10 mins",
      "target":["area"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you create an invisible, insubstantial wall of energy within 60 feet of you that is up to 30 feet long, 10 feet high, and 1 foot thick. The wall lasts until your concentration ends. Any creature attempting to move through it must make a Wisdom saving throw. On a failed save, a creature can’t move through the wall until the start of its next turn. On a successful save, the creature can pass through it. A creature must make this save whenever it attempts to pass through the wall, whether willingly or unwillingly."
    }, {
      "name":"Visions of Disgust",
      "cost":"5",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"5d6 psychic",
      "description":"You cause a creature to regard all other beings as horrid, alien entities. As an action, choose one creature you can see within 60 feet of you. The target must make a Wisdom saving throw. On a failed save, it takes 5d6 psychic damage, and until your concentration ends, it takes 1d6 psychic damage per creature within 5 feet of it at the end of each of its turns. On a successful save, the target takes only half the initial damage and suffers none of the other effects."
    }, {
      "name":"World of Horror",
      "cost":"7",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["self", "creatures"],
      "range":"60ft",
      "damage":"8d6 psychic",
      "description":"As an action, choose up to six creatures within 60 feet of you. Each target must make a Charisma saving throw. On a failed save, a target takes 8d6 psychic damage, and it is frightened until your concentration ends. On a successful save, a target takes half as much damage. While frightened by this effect, a target’s speed is reduced to 0, and the target can use its action, and any bonus action it might have, only to make melee attacks. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }]
}