{
    "name":"Crown of Despair",
    "description":"You have learned to harvest seeds of despair in a creature’s psyche, wracking it with self-doubt and inaction.",
    "order":"Consular",
    "focus":"While focused on this discipline, you have advantage on Charisma (Intimidation) checks.",
    "abilities":[{
      "name":"Crowned in Sorrow",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"round",
      "target":["creature"],
      "range":"60ft",
      "damage":"nd8 psychic",
      "description":"As an action, one creature you can see within 60 feet of you must make a Charisma saving throw. On a failed save, it takes 1d8 psychic damage per force point spent, and it can’t take reactions until the start of its next turn. On a successful save, it takes half as much damage."
    }, {
      "name":"Call to Inaction",
      "cost":"2",
      "conc":true,
      "casting_time":"1 minute",
      "duration":"10 mins",
      "target":["creature"],
      "range":"",
      "damage":"",
      "description":"If you spend 1 minute conversing with a creature, you can attempt to seed it with overwhelming ennui. At the end of the minute, you can use an action to force the creature to make a Wisdom saving throw. The save automatically succeeds if the target is immune to being charmed. On a failed save, it sits and is incapacitated until your concentration ends. This effect immediately ends if the target or any ally it can see is attacked or takes damage. On a successful save, the creature is unaffected and has no inkling of your attempt to bend its will."
    }, {
      "name":"Visions of Despair",
      "cost":"3-7",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["creature"],
      "range":"60ft",
      "damage":"nd6 psychic",
      "description":"As an action, you force one creature you can see within 60 feet of you to make a Charisma saving throw. On a failed save, it takes 1d6 psychic damage per force point spent, and its speed is reduced to 0 until the end of its next turn. On a successful save, it takes half as much damage."
    }, {
      "name":"Dolorous Mind",
      "cost":"5",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you choose one creature you can see within 60 feet of you. It must succeed on a Charisma saving throw, or it is incapacitated and has a speed of 0 until your concentration ends. It can repeat this saving throw at the end of each of its turns, ending the effect on itself on a success. "
    }]
}