{
    "name":"Force Weapon",
    "description":"You have learned how to channel force energy into your attacks, lending them devastating power.",
    "order":"Guardian",
    "focus":"Whenever you focus on this discipline, choose one weapon you’re holding or your unarmed strike. When you attack with it while focused on this discipline, its damage is psychic and magical, rather than its normal damage type. Until you reach 6th level as a force wielder, you don’t add your Strength or Dexterity modifier to the psychic attack’s damage rolls.",
    "abilities":[{
      "name":"Ethereal Weapon",
      "cost":"1",
      "conc":false,
      "casting_time":"bonus",
      "duration":"turn",
      "target":["item"],
      "range":"touch",
      "damage":"",
      "description":"As a bonus action, you temporarily transform one weapon you’re holding or your unarmed strike into pure force energy. The next attack you make with it before the end of your turn ignores the target’s armor, requiring no attack roll. Instead, the target makes a Dexterity saving throw against this discipline. On a failed save, the target takes the attack’s normal damage and suffers its additional effects. On a successful save, the target takes half damage from the attack but suffers no additional effects that would normally be imposed on a hit."
    }, {
      "name":"Lethal Strike",
      "cost":"1-7",
      "conc":false,
      "casting_time":"bonus",
      "duration":"turn",
      "target":["item"],
      "range":"touch",
      "damage":"nd10 psychic",
      "description":"As a bonus action, you imbue a weapon you’re holding or your unarmed strike with force energy. The next time you hit with it before the end of your turn, it deals an extra 1d10 damage of the weapon's damage type per point spent. The damage type can be chosen between cold, fire, force, lightning, or radiant at the cost of an additional force point."
    }, {
      "name":"Augmented Weapon",
      "cost":"5",
      "conc":true,
      "casting_time":"bonus",
      "duration":"10 mins",
      "target":["item"],
      "range":"touch",
      "damage":"",
      "description":"As a bonus action, touch one simple or martial weapon. Until your concentration ends, that weapon becomes a magic weapon with a +3 bonus to its attack and damage rolls."
    }]
}