{
    "name":"Force Mind",
    "description":"You dispatch part of your psyche into the noosphere, the collective vista of minds and knowledge possessed by living things.",
    "order":"Consular",
    "focus":"Whenever you focus on this discipline, you choose one skill or tool and have proficiency with it until your focus ends. Alternatively, you gain the ability to read and write one language of your choice until your focus ends.",
    "abilities":[{
      "name":"Wandering Mind",
      "cost":"2-6",
      "conc":true,
      "casting_time":"10 mins",
      "duration":"1 hour",
      "target":["self"],
      "range":"",
      "damage":"",
      "description":"You enter a deep contemplation. If you concentrate for this option’s full duration, you then gain proficiency with up to three of the following skills (one skill for every 2 force points spent): Animal Handling, Arcana, History, Medicine, Nature, Performance, Religion, and Survival. The benefit lasts for 1 hour, no concentration required."
    }, {
      "name":"Find Creature",
      "cost":"2",
      "conc":true,
      "casting_time":"1 hour",
      "duration":"",
      "target":["self", "creature"],
      "range":"",
      "damage":"",
      "description":"You cast your mind about for information about a specific creature. If you concentrate for this option’s full duration, you then gain a general understanding of the creature’s current location. You learn the region, city, town, village, or district where it is, pinpointing an area between 1 and 3 miles on a side (DM’s choice). If the creature is on another plane of existence, you instead learn which plane."
    }, {
      "name":"Item Lore",
      "cost":"3",
      "conc":true,
      "casting_time":"1 hour",
      "duration":"",
      "target":["item"],
      "range":"5 ft",
      "damage":"",
      "description":"You carefully study an item. If you concentrate for this option’s full duration while remaining within 5 feet of the item, you then gain the benefits of an identify spell cast on that item."
    }, {
      "name":"Psychic Speach",
      "cost":"5",
      "conc":false,
      "casting_time":"action",
      "duration":"1 hour",
      "target":["self"],
      "range":"",
      "damage":"",
      "description":"As an action, you attune your mind to the psychic imprint of all language. For 1 hour, you gain the ability to understand any language you hear or attempt to read. In addition, when you speak, all creatures that can understand a language understand what you say, regardless of what language you use."
    }, {
      "name":"Wandering Eye",
      "cost":"6",
      "conc":true,
      "casting_time":"action",
      "duration":"1 hour",
      "target":["point"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you create a psychic sensor within 60 feet of you. The sensor lasts until your concentration ends. The sensor is invisible and hovers in the air. You mentally receive visual information from it, which has normal vision and darkvision with a range of 60 feet. The sensor can look in all directions. As an action, you can move the sensor up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can’t enter another plane of existence. A solid barrier blocks the eye’s movement, but the eye can pass through an opening as small as 1 inch in diameter."
    }, {
      "name":"Phasing Eye",
      "cost":"7",
      "conc":true,
      "casting_time":"action",
      "duration":"1 hour",
      "target":["point"],
      "range":"60ft",
      "damage":"",
      "description":"As Wandering Eye above, except the eye can move through solid objects but can’t end its movement in one. If it does so, the effect immediately ends."
    }]
}