{
    "name":"Mantle of Awe",
    "description":"You learn to use force energy to manipulate others with a subtle combination of force and your own, natural charm.",
    "order":"Adept",
    "focus":"While focused on this discipline, you gain a bonus to Charisma checks. The bonus equals half your Intelligence modifier (minimum of +1).",
    "abilities":[{
      "name":"Charming Presence",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"10 mins",
      "target":["creatures"],
      "range":"30ft",
      "damage":"2 * nd8 HP",
      "description":"As an action, you exert an aura of sympathetic power. Roll 2d8 per force point spent on this ability; the total is how many hit points worth of creatures this option can affect. Creatures within 30 feet of you are affected in ascending order of their hit point maximums, ignoring incapacitated creatures, creatures immune to being charmed, and creatures engaged in combat.\\nStarting with the creature that has the lowest hit point maximum, each creature affected by this option is charmed by you for 10 minutes, regarding you as a friendly acquaintance. Subtract each creature’s hit point maximum from the total before moving on to the next creature. A creature’s hit point maximum must be equal to or less than the remaining total for that creature to be affected."
    }, {
      "name":"Center of Attention",
      "cost":"2",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you exert an aura of power that grabs a creature's attention. Choose one creature you can see within 60 feet of you. It must make a Charisma saving throw. On a failed save, the creature is so thoroughly distracted by you that all other creatures are invisible to it until your concentration ends. This effect ends if the creature can no longer see or hear you or if it takes damage."
    }, {
      "name":"Invoke Awe",
      "cost":"7",
      "conc":true,
      "casting_time":"action",
      "duration":"10 mins",
      "target":["creatures"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you exert an aura that inspires awe in others. Choose up to 5 creatures you can see within 60 feet of you. Each target must succeed on an Intelligence saving throw or be charmed by you until your concentration ends. While charmed, the target obeys all your verbal commands to the best of its ability and without doing anything obviously self-destructive. The charmed target will attack only creatures that it has seen attack you since it was charmed or that it was already hostile toward. At the end of each of its turns, it can repeat the saving throw, ending the effect on itself on a success."
    }]
}