{
    "name":"Mastery of Ice",
    "description":"You master the power of ice, shaping it to meet you demands.",
    "order":"Consular",
    "focus":"While focused on this discipline, you have resistance to cold damage.",
    "abilities":[{
      "name":"Ice Spike",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["creature"],
      "range":"120ft",
      "damage":"nd8 cold",
      "description":"As an action, you hurl a mote of ice at one creature you can see within 120 feet of you. The target must make a Dexterity saving throw. On a failed save, the target takes 1d8 cold damage per force point spent and has its speed halved until the start of your next turn. On a successful save, the target takes half as much damage."
    },{
      "name":"Ice Sheet",
      "cost":"2",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["point"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, choose a point on the ground you can see within 60 feet of you. The ground in a 20-foot radius centered on that point becomes covered in ice for 10 minutes. It is difficult terrain, and any creature that moves more than 10 feet on it must succeed on a Dexterity saving throw or fall prone. If the surface is sloped, a creature that falls prone in the area immediately slides to the bottom of the slope."
    }, {
      "name":"Frozen Sanctuary",
      "cost":"3",
      "conc":false,
      "casting_time":"bonus",
      "duration":"",
      "target":["self"],
      "range":"",
      "damage":"20hp",
      "description":"As a bonus action, you sheathe yourself with icy resilience. You gain 20 temporary hit points."
    }, {
      "name":"Frozen Rain",
      "cost":"5",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["point"],
      "range":"120ft",
      "damage":"6d6 cold + nd6",
      "description":"As an action, choose a point you can see within 120 feet of you. The air in a 20-foot-radius sphere centered on that point becomes deathly cold and saturated with moisture. Each creature in that area must make a Constitution saving throw. On a failed save, a target takes 6d6 cold damage, and its speed is reduced to 0 until your concentration ends. On a successful save, a target takes half as much damage.<br/><br/>As an action, a target that has its speed reduced can end the effect early if it succeeds on a Strength (Athletics) check with a DC equal to this effect’s save DC.<br/><br/>You can increase this effect’s damage by 1d6 per each additional force point spent on it."
    }, {
      "name":"Ice Barrier",
      "cost":"6",
      "conc":true,
      "casting_time":"action",
      "duration":"10 mins",
      "target":[],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you create a wall of ice, at least one portion of which must be within 60 feet of you. The wall is 60 feet long, 15 feet high, and 1 foot thick. The wall lasts until your concentration ends. Each 10-foot section of the wall has AC 12 and 30 hit points. A creature that damages the wall with a melee attack takes cold damage equal to the damage the creature dealt to the wall."
    }]
}
