{
    "name":"Mastery of Weather",
    "description":"Your mind reaches into the sky, reshaping the stuff of storms to serve your needs.",
    "order":"Sentinel",
    "focus":"While focused on this discipline, you have resistance to lightning and thunder damage.",
    "abilities":[{
      "name":"Cloud Steps",
      "cost":"1-7",
      "conc":true,
      "casting_time":"action",
      "duration":"10 mins",
      "target":[],
      "range":"sight",
      "damage":"",
      "description":"As an action, you conjure forth clouds to create a solid, translucent staircase that lasts until your concentration ends. The stairs form a spiral that fills a 10-foot-by-10-foot area and reaches upward 20 feet per force point spent."
    },{
      "name":"Hungry Lightning",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["creature"],
      "range":"60ft",
      "damage":"nd8 lightning",
      "description":"As an action, you lash out at one creature you can see within 60 feet of you with tendrils of lightning. The target must make a Dexterity saving throw, with disadvantage if it’s wearing heavy armor. The target takes 1d8 lightning damage per force point spent on a failed save, or half as much damage on a successful one."
    }, {
      "name":"Wall of Clouds",
      "cost":"2",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":[],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you create a wall of clouds, at least one portion of which must be within 60 feet of you. The wall is 60 feet long, 15 feet high, and 1 foot thick. The wall lasts until your concentration ends. Creatures can pass through it without hindrance, but the wall blocks vision."
    }, {
      "name":"Whirlwind",
      "cost":"2",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["point"],
      "range":"60ft",
      "damage":"1d6 bludgeoning",
      "description":"As an action, choose a point you can see within 60 feet of you. Winds howl in a 20-foot-radius sphere centered on that point. Each creature in the sphere must succeed on a Strength saving throw or take 1d6 bludgeoning damage and be moved to an unoccupied space of your choice in the sphere. Any loose object in the sphere is moved to an unoccupied space of your choice within it if the object weighs no more than 100 pounds."
    }, {
      "name":"Lightning Leap",
      "cost":"5",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["line"],
      "range":"60ft",
      "damage":"6d6 lightning + nd6",
      "description":"As an action, you let loose a line of lightning that is 60 feet long and 5 feet wide. Each creature in the line must make a Dexterity saving throw, taking 6d6 lightning damage on a failed save, or half as much damage on a successful one. You can then teleport to an unoccupied space touched by the line.\n\nYou can increase this ability’s damage by 1d6 per additional force point spent on it."
    }, {
      "name":"Wall of Thunder",
      "cost":"6",
      "conc":true,
      "casting_time":"action",
      "duration":"10 mins",
      "target":[],
      "range":"60ft",
      "damage":"6d6 thunder",
      "description":"As an action, you create a wall of thunder, at least one portion of which must be within 60 feet of you. The wall is 60 feet long, 15 feet high, and 1 foot thick. The wall lasts until your concentration ends. Every foot moved through the wall costs 1 extra foot of movement. When a creature moves into the wall’s space for the first time on a turn or starts its turn there, that creature must succeed on a Strength saving throw, or it takes 6d6 thunder damage, is pushed in a straight line up to 30 feet away from the wall, and is knocked prone."
    }, {
      "name":"Thunder Clap",
      "cost":"7",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["point"],
      "range":"60ft",
      "damage":"8d6 thunder",
      "description":"As an action, choose a point you can see within 60 feet of you. Thunder energy erupts in a 20-foot-radius sphere centered on that point. Each creature in that area must make Constitution saving throw. On a failed save, a target takes 8d6 thunder damage, and it is stunned until the end of your next turn. On a successful save, a target takes half as much damage."
    }]
}
