{
    "name":"Psychic Assault",
    "description":"You wield your mind like a weapon, unleashing salvos of force energy.",
    "order":"Adept",
    "focus":"While focused on this discipline, you gain a +2 bonus to damage rolls with force talents that deal psychic damage.",
    "abilities":[{
      "name":"Force Blast",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"instant",
      "target":["creature"],
      "range":"60ft",
      "damage":"nd8 psychic",
      "description":"As an action, choose one creature you can see within 60 feet of you. The target takes 1d8 psychic damage per point spent on this ability."
    }, {
      "name":"Ego Whip",
      "cost":"3",
      "conc":false,
      "casting_time":"action",
      "duration":"instant",
      "target":["creature"],
      "range":"60ft",
      "damage":"3d8 psychic",
      "description":"As an action, choose one creature you can see within 60 feet of you. The target must make an Intelligence saving throw. On a failed save, the creature takes 3d8 psychic damage, and it is filled with self-doubt, leaving it able to use its action on its next turn only to take the Dodge, Disengage, or Hide action. On a successful saving throw, it takes half as much damage."
    }, {
      "name":"Id Insinuation",
      "cost":"5",
      "conc":false,
      "casting_time":"action",
      "duration":"instant",
      "target":["creature"],
      "range":"60ft",
      "damage":"5d8 psychic",
      "description":"As an action, choose one creature you can see within 60 feet of you. The target must make an Intelligence saving throw. On a failed save, the creature takes 5d8 psychic damage, and it goes into a fury, as its id runs rampant. On its next turn, it can use its action only to take the Dodge or Attack action. On a successful save, it takes half as much damage."
    }, {
      "name":"Psychic Blast",
      "cost":"6",
      "conc":false,
      "casting_time":"action",
      "duration":"instant",
      "target":["60ft cone"],
      "range":"60ft",
      "damage":"8d8 psychic",
      "description":"As an action, you unleash devastating psychic energy in a 60-foot cone. Each creature in that area must make an Intelligence saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one. You can increase the damage by 2d8 if you spend 1 more point on this ability."
    }, {
      "name":"Psychic Crush",
      "cost":"7",
      "conc":false,
      "casting_time":"action",
      "duration":"instant",
      "target":["20ft cube"],
      "range":"120ft",
      "damage":"8d8 psychic",
      "description":"As an action, you create a 20-foot cube of psychic energy within 120 feet of you. Each creature in that area must make an Intelligence saving throw. On a failed save, a target takes 8d8 psychic damage and is stunned until the end of your next turn. On a successful save, a target takes half as much damage."
    }]
}