{
    "name":"Psychic Phantoms",
    "description":"Your power reaches into a creature’s mind and causes it false perceptions.",
    "order":"Guardian",
    "focus":"While focused on this discipline, you have advantage on Charisma (Deception) checks.",
    "abilities":[{
      "name":"Distracting Figment",
      "cost":"1-7",
      "conc":false,
      "casting_time":"action",
      "duration":"round",
      "target":["creature"],
      "range":"60ft",
      "damage":"nd10 psychic",
      "description":"As an action, choose one creature you can see within 60 feet of you. The target must make an Intelligence saving throw. On a failed save, it takes 1d10 psychic damage per point spent and thinks it perceives a threatening creature just out of its sight; until the end of your next turn, it can’t use reactions, and melee attack rolls against it have advantage. On a successful save, it takes half as much damage."
    }, {
      "name":"Phantom Foe",
      "cost":"3",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"(n - 2)d8 psychic",
      "description":"As an action, choose one creature you can see within 60 feet of you. The target must make an Intelligence saving throw. On a failed save, it perceives a horrid creature adjacent to it until your concentration ends. During this time, the target can’t take reactions, and it takes 1d8 psychic damage at the start of each of its turns. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. You can increase the damage by 1d8 for each additional point spent on the ability."
    }, {
      "name":"Phantom Betrayal",
      "cost":"5",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you plant delusional paranoia in a creature’s mind. Choose one creature you can see within 60 feet of you. The target must succeed on an Intelligence saving throw, or until your concentration ends, it must target its allies with attacks and other damaging effects. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. A creature is immune to this ability if it is immune to being charmed."
    }, {
      "name":"Phantom Riches",
      "cost":"7",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you plant the phantom of a greatly desired object in a creature’s mind. Choose one creature you can see within 60 feet of you. The target must make an Intelligence saving throw. On a failed save, you gain partial control over the target’s behavior until your concentration ends; the target moves as you wish on each of its turns, as it thinks it pursues the phantom object it desires. If it hasn’t taken damage since its last turn, it can use its action only to admire the object you created in its perception. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
    }]
}