{
    "name":"Pyrokinesis",
    "description":"You align your mind with the energy of fire.",
    "order":"Guardian",
    "focus":"While focused on this discipline, you gain resistance to fire damage, and you gain a +2 bonus to rolls for fire damage.",
    "abilities":[{
      "name":"Combustion",
      "cost":"1-7",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature", "object"],
      "range":"120ft",
      "damage":"nd10 fire",
      "description":"As an action, choose one creature or object you can see within 120 feet of you. The target must make a Constitution save. On a failed save, the target takes 1d10 fire damage per force point spent, and it catches on fire, taking 1d6 fire damage at the end of each of its turns until your concentration ends or until it or a creature adjacent to it extinguishes the flames with an action. On a successful save, the target takes half as much damage and doesn’t catch on fire."
    },{
      "name":"Rolling Flame",
      "cost":"3",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":[],
      "range":"5ft",
      "damage":"5 fire",
      "description":"As an action, you create fire in a 20-foot-by-20-foot cube within 5 feet of you. The fire lasts until your concentration ends. Any creature in that area when you use this ability and any creature that ends its turn there takes 5 fire damage."
    }, {
      "name":"Flamusfracta",
      "cost":"5",
      "conc":false,
      "casting_time":"action",
      "duration":"",
      "target":["point"],
      "range":"120ft",
      "damage":"7d6",
      "description":"As an action, you create a fiery explosion at a point you can see within 120 feet of you. Each creature in a 20-foot-radius sphere centered on that point must make a Constitution saving throw, taking 7d6 fire damage and being knocked prone on a failed save, or half as much damage on a successful one."
    }, {
      "name":"Fire Form",
      "cost":"5",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["self"],
      "range":"5ft",
      "damage":"3d6 fire",
      "description":"As a bonus action, you become wreathed in flames until your concentration ends. Any creature that end its turn within 5 feet of you takes 3d6 fire damage."
    }]
}
