{
    "name":"Telepathic Contact",
    "description":"By channeling force power, you gain the ability to control other creatures by substituting your will for their own.",
    "order":"Consular",
    "focus":"While focused on this discipline, you gain the ability to use your Telepathy class feature with up to six creatures at once. If you don’t have that feature from your force wielder class, you instead gain it while focused on this discipline.",
    "abilities":[{
      "name":"Exacting Query",
      "cost":"2",
      "conc":false,
      "casting_time":"action",
      "duration":"instant",
      "target":["creature"],
      "range":"telepathy",
      "damage":"",
      "description":"As an action, you target one creature you can communicate with via telepathy. The target must make an Intelligence saving throw. On a failed save, the target truthfully answers one question you ask it via telepathy. On a successful save, the target is unaffected, and you can’t use this ability on it again until you finish a long rest. A creature is immune to this ability if it is immune to being charmed."
    }, {
      "name":"Occluded Mind",
      "cost":"2",
      "conc":false,
      "casting_time":"action",
      "duration":"5 min",
      "target":["creature"],
      "range":"telepathy",
      "damage":"",
      "description":"As an action, you target one creature you can communicate with via telepathy. The target must make an Intelligence saving throw. On a failed save, the target believes one statement of your choice for the next 5 minutes that you communicate to it via telepathy. The statement can be up to ten words long, and it must describe you or a creature or an object the target can see. On a successful save, the target is unaffected, and you can’t use this ability on it again until you finish a long rest. A creature is immune to this ability if it is immune to being charmed."
    }, {
      "name":"Broken Will",
      "cost":"5",
      "conc":false,
      "casting_time":"action",
      "duration":"turn",
      "target":["creature"],
      "range":"telepathy",
      "damage":"",
      "description":"As an action, you target one creature you can communicate with via telepathy. The target must make an Intelligence saving throw. On a failed save, you choose the target’s movement and action on its next turn. On a successful save, the target is unaffected, and you can’t use this ability on it again until you finish a long rest. A creature is immune to this ability if it is immune to being charmed."
    }, {
      "name":"Psychic Grip",
      "cost":"6",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you target one creature you can see within 60 feet of you. The target must succeed on an Intelligence saving throw, or it is paralyzed until your concentration ends. At the end of each of its turns, it can repeat the saving throw. On a success, this effect ends. On a failure, you can use your reaction to force the target to move up to half its speed, even though it’s paralyzed."
    }, {
      "name":"Psychic Domination",
      "cost":"7",
      "conc":true,
      "casting_time":"action",
      "duration":"1 min",
      "target":["creature"],
      "range":"60ft",
      "damage":"",
      "description":"As an action, you target one creature you can see within 60 feet of you. The target must succeed on an Intelligence saving throw, or you choose the creature’s actions and movement on its turns until your concentration ends. At the end of each of its turns, it can repeat the saving throw, ending the effect on itself on a success. A creature is immune to this ability if it is immune to being charmed."
    }]
}